package lesson140;

public class HW {
    /*в классе  Box  создать метод который принимает в качестве параметров объект box и возвращает новую коробку у которой все размеры равны:
        размеры вызывающего объекта + размеры переданного объекта
        (длина новой коробки= длине кробки у которой вызывали метод + длина коробки которую вызывали в качестве параметра, также у ширины и высоты).


        Создать конструктор который принимает 2 коробки.С помощью конструктора можно будет создать
        объект который по объему больше чем 2 переданные коробки вместе взятые.
        В итоге должна получиться коробка которая по объему больше чем объем тех  двух коробок вместе взятых

        Продемонстрировать работу в методе main.
     */

}
